Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnitEnum
The length unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnitEnum.MM
Millimeters.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnitEnum.CM
Centimeters.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnitEnum.M
Meters.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnitEnum.IN
Inches decimal.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnitEnum.FT
Feet decimal.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnitEnum.FT_IN
Feet inches imperial.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnitEnum.UNKNOWN
unknown unit.